In [3]:
import pandas as pd

data1={ "Emp Id":["E01","E02","EO3","EO4","E05","E06"],
       "Names":["ram ","Shyam,","Rahul","Vishal","John","Ravi"],
       "Age":[34,56,23,44,32,36],
    
}
data2={ "Emp Id":["E01","E02","EO3","EO4","E05","E06"],
       "Salary":[3400,5600,2300,4400,3200,3600], }
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)


print(df1)
print("--------------------------")
print(df2)

  Emp Id   Names  Age
0    E01    ram    34
1    E02  Shyam,   56
2    EO3   Rahul   23
3    EO4  Vishal   44
4    E05    John   32
5    E06    Ravi   36
--------------------------
  Emp Id  Salary
0    E01    3400
1    E02    5600
2    EO3    2300
3    EO4    4400
4    E05    3200
5    E06    3600

In [5]:
print(pd.merge(df1,df2,on="Emp Id"))

  Emp Id   Names  Age  Salary
0    E01    ram    34    3400
1    E02  Shyam,   56    5600
2    EO3   Rahul   23    2300
3    EO4  Vishal   44    4400
4    E05    John   32    3200
5    E06    Ravi   36    3600

In [11]:
#what if there is null value

data3={ "Emp Id":["E01","E02","EO3","EO4","E05","E06"],
       "Names":["ram ","Shyam,","Rahul","Vishal","John","Ravi"],
       "Age":[34,56,23,44,32,36],
    
}
data4={ "Emp Id":["E01","E07","EO3","EO4","E08","E06"], #here E07and  E08 is not available
       "Salary":[3400,5600,2300,4400,3200,3600], }
df3=pd.DataFrame(data3)
df4=pd.DataFrame(data4)
print(df3)
print(df4)

  Emp Id   Names  Age
0    E01    ram    34
1    E02  Shyam,   56
2    EO3   Rahul   23
3    EO4  Vishal   44
4    E05    John   32
5    E06    Ravi   36
  Emp Id  Salary
0    E01    3400
1    E07    5600
2    EO3    2300
3    EO4    4400
4    E08    3200
5    E06    3600

In [13]:
print(pd.merge(left=df3,right=df4,on ="Emp Id" ,how="left"))

  Emp Id   Names  Age  Salary
0    E01    ram    34  3400.0
1    E02  Shyam,   56     NaN
2    EO3   Rahul   23  2300.0
3    EO4  Vishal   44  4400.0
4    E05    John   32     NaN
5    E06    Ravi   36  3600.0

In [14]:
print(pd.merge(left=df3,right=df4,on ="Emp Id" ,how="right"))

  Emp Id   Names   Age  Salary
0    E01    ram   34.0    3400
1    E07     NaN   NaN    5600
2    EO3   Rahul  23.0    2300
3    EO4  Vishal  44.0    4400
4    E08     NaN   NaN    3200
5    E06    Ravi  36.0    3600

In [16]:
data5={ "Emp Id":["E01","E02","EO3","EO4","E05","E06"],
       "Names":["ram ","Shyam,","Rahul","Vishal","John","Ravi"],
       "Age":[34,56,23,44,32,36],
    
}
data6={ "Emp Id":["E07","E08","EO9","E10","E11","E12"],
       "Names":["Rohit","Virat","Rahul ","Dravid","jaiswal","Pant"],
      "Age":[38,36,32,48,22,28], }
df5=pd.DataFrame(data5)
df6=pd.DataFrame(data6)
print(pd.concat([df5,df6]))

  Emp Id    Names  Age
0    E01     ram    34
1    E02   Shyam,   56
2    EO3    Rahul   23
3    EO4   Vishal   44
4    E05     John   32
5    E06     Ravi   36
0    E07    Rohit   38
1    E08    Virat   36
2    EO9   Rahul    32
3    E10   Dravid   48
4    E11  jaiswal   22
5    E12     Pant   28